data_generation/simulation_results/openfoam/case_24/constant/simParams
nIter 2000;
hComponent0 851.1069625042394;
hComponent1 1291.9506783539464;
hComponent2 1335.6586112028422;
hComponent3 835.2741290322533;
hComponent4 773.8593567225068;kComponent0 27.608184892911076;
kComponent1 38.18491867539184;
kComponent2 65.06387208887219;
kComponent3 57.41242167160432;
kComponent4 98.35718009702452;
tAmbient 300;
Ux 1.3487163091554473;
kPCB 0.2353638022335002;