data_generation/simulation_results/openfoam/case_24/system/fvConstraints
limitTair
{
    type limitTemperature;
    selectionMode all;
    min 310;
    max 500;
    phase air;
}
